// BlogSection.jsx
const BlogSection = () => {
  return <div>
    <div className="flex flex-col items-end w-full text-right mb-[2.5rem]">
{/* عکس مخصوص دسکتاپ */}
<img
  src="/src/assets/images/blogimg.jpg"
  alt="Desktop"
  className=" w-[55.375rem] h-[37.25rem] mb-[1.25rem]"
/>

<div className="w-full flex flex-row flex-wrap-reverse items-start gap-4 mt-[2rem] mb-[2.5rem]" dir="rtl">
  <span className="bg-[#00395D] text-white px-4 py-1 rounded-[0.313rem] text-sm ">
    استایل کژوال
  </span>
  <span className="text-sm text-gray-500">۳ اسفند ۱۳۷۹</span>
  <span className="text-sm text-gray-500">۷ دقیقه مطالعه</span>
</div>

          <div className="txt w-[55.375rem] h-[39.938rem] text-[#283944] text-justify leading-relaxed">
            <p 
            className='text-[22px] text-[#283944] mb-[1.188rem] font-black ' >t چند راه مختلف برای ایجاد وب سایت رایگان خ</p>
            <p 
            className='w-[55.375rem] h-[11.25rem] text-[#283944]'>بله.melonest چند راه مختلف برای ایجاد وب سایت رایگان خود ارائه می دهد، بنابراین می توانید فرآیند ایجاد
ا انتخاب کنید که بهترین کار را برای شما دارد. از بین بیش از 900 الگوی طراحی شده انتخاب کنید، یا از سازنده ر
 وب سایت هوش مصنوعی ما برای ایجاد یک سایت آماده برای کسب و کار در کمترین زمان با استفاده از یک رر
رابط مکالمه استفاده کنید. همچنین می توانید با استفاده از کش و رها کردن وب سایت ساز melonest از ابتدا 
کنید. هر راهی را که انتخاب کنید، همیشه می توانید برای آزادی کامل طراحی وب سایت، سفارشی سازی را در رر
ویرایشگر ادامه دهید. کنید، همیشه می توانید برای آزادی کامل طراحی وب سایت، سفارشی سازی را در ررسنتی</p>
             <p
              className='text-[22px] text-[#283944] mb-[1.188rem] font-black'>t چند راه مختلف برای ایجاد وب سایت رایگان خ</p>
             <p 
             className='w-[55.375rem] h-[20.625rem] text-[#283944]'>بله.melonest چند راه مختلف برای ایجاد وب سایت رایگان خود ارائه می دهد، بنابراین می توانید فرآیند ایجاد
ا انتخاب کنید که بهترین کار را برای شما دارد. از بین بیش از 900 الگوی طراحی شده انتخاب کنید، یا از سازنده ر
 وب سایت هوش مصنوعی ما برای ایجاد یک سایت آماده برای کسب و کار در کمترین زمان با استفاده از یک رر
رابط مکالمه استفاده کنید. همچنین می توانید با استفاده از کش و رها کردن وب سایت ساز melonest از ابتدا 
کنید. هر راهی را که انتخاب کنید، همیشه می توانید برای آزادی کامل طراحی وب سایت، سفارشی سازی را در رر
ویرایشگر ادامه دهید. کنید، همیشه می توانید برای آزادی کامل طراحی وب سایت، سفارشی سازی را در ررسنتیبله
ا انتخاب کنید که بهترین کار را برای شما دارد. از بین بیش از 900 الگوی طراحی شده انتخاب کنید، یا از سازنده ر
 وب سایت هوش مصنوعی ما برای ایجاد یک سایت آماده برای کسب و کار در کمترین زمان با استفاده از یک رر
رابط مکالمه استفاده کنید. همچنین می توانید با استفاده از کش و رها کردن وب سایت ساز melonest از ابتدا 
کنید. هر راهی را که انتخاب کنید، همیشه می توانید برای آزادی کامل طراحی وب سایت، سفارشی سازی را در رر
ویرایشگر ادامه دهید. کنید، همیشه می توانید برای آزادی کامل طراحی وب سایت، سفارشی سازی را در ررسنتی</p>
          </div>
        </div>
  </div>;
};

export default BlogSection;